0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  12
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pOut            1e5;

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pOut;

boundaryField
{
    "(inlet|floor)"
    {
        type            zeroGradient;
    }

    "(outlet|front|back|top)"
    {
        type            totalPressure;
        p0              uniform $pOut;
        value           uniform $pOut;
    }


    canyonHVAC-Zona_4-Ar_Condicionado_6
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_9-cobertura_4
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_13-cobertura_7
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_5-cobertura_4
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_13-fachada_1
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_2-Ar_Condicionado_6
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_12-fachada_2
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_10-cobertura_7
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_11-fachada_0
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_13-fachada_0
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_8-fachada_3
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_9-fachada_1
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_6-fachada_1
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_3-Ar_Condicionado_6
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_5-fachada_0
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_9-Ar_Condicionado_6
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_2-fachada_0
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_3-fachada_2
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_10-fachada_5
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_11-fachada_6
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_3-fachada_0
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_9-fachada_3
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_11-cobertura_7
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_6-Ar_Condicionado_6
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_6-fachada_3
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_10-fachada_0
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_8-Ar_Condicionado_6
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_5-Ar_Condicionado_6
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_8-fachada_1
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_7-Ar_Condicionado_6
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_13-fachada_2
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_12-fachada_0
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_7-fachada_3
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_4-fachada_2
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_10-fachada_6
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_7-fachada_1
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_12-fachada_1
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_4-fachada_0
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_12-cobertura_7
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_2-fachada_2
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_11-fachada_5
    {
        type            zeroGradient;
    }
    canyonHVAC-Zona_5-fachada_2
    {
        type            zeroGradient;
    }


    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
