0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  12
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 290;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    "(outlet|front|back|top)"
    {
        type            zeroGradient;
    }

    floor
    {
        type            fixedValue;
        value           uniform 290.0;
    }

  canyonHVAC-Zona_4-Ar_Condicionado_6
  {
      type            fixedGradient;
      gradient        uniform 122.76;
      value           uniform 300.0;
  }

  canyonHVAC-Zona_9-cobertura_4
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_13-cobertura_7
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_5-cobertura_4
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_13-fachada_1
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_2-Ar_Condicionado_6
  {
      type            fixedGradient;
      gradient        uniform 122.76;
      value           uniform 300.0;
  }

  canyonHVAC-Zona_12-fachada_2
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_10-cobertura_7
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_11-fachada_0
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_13-fachada_0
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_8-fachada_3
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_9-fachada_1
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_6-fachada_1
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_3-Ar_Condicionado_6
  {
      type            fixedGradient;
      gradient        uniform 122.76;
      value           uniform 300.0;
  }

  canyonHVAC-Zona_5-fachada_0
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_9-Ar_Condicionado_6
  {
      type            fixedGradient;
      gradient        uniform 122.76;
      value           uniform 300.0;
  }

  canyonHVAC-Zona_2-fachada_0
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_3-fachada_2
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_10-fachada_5
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_11-fachada_6
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_3-fachada_0
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_9-fachada_3
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_11-cobertura_7
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_6-Ar_Condicionado_6
  {
      type            fixedGradient;
      gradient        uniform 122.76;
      value           uniform 300.0;
  }

  canyonHVAC-Zona_6-fachada_3
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_10-fachada_0
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_8-Ar_Condicionado_6
  {
      type            fixedGradient;
      gradient        uniform 122.76;
      value           uniform 300.0;
  }

  canyonHVAC-Zona_5-Ar_Condicionado_6
  {
      type            fixedGradient;
      gradient        uniform 122.76;
      value           uniform 300.0;
  }

  canyonHVAC-Zona_8-fachada_1
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_7-Ar_Condicionado_6
  {
      type            fixedGradient;
      gradient        uniform 122.76;
      value           uniform 300.0;
  }

  canyonHVAC-Zona_13-fachada_2
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_12-fachada_0
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_7-fachada_3
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_4-fachada_2
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_10-fachada_6
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_7-fachada_1
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_12-fachada_1
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_4-fachada_0
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_12-cobertura_7
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_2-fachada_2
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_11-fachada_5
  {
      type            fixedValue;
      value           uniform 292.15;
  }

  canyonHVAC-Zona_5-fachada_2
  {
      type            fixedValue;
      value           uniform 292.15;
  }



    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
