0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  12
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    
    front
    {
        type            calculated;
        value           uniform 0;
    }
    
    back
    {
        type            calculated;
        value           uniform 0;
    }
    
    top
    {
        type            calculated;
        value           uniform 0;
    }
    
    floor
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    canyonHVAC-Zona_4-Ar_Condicionado_6
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_9-cobertura_4
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_13-cobertura_7
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_5-cobertura_4
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_13-fachada_1
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_2-Ar_Condicionado_6
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_12-fachada_2
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_10-cobertura_7
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_11-fachada_0
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_13-fachada_0
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_8-fachada_3
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_9-fachada_1
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_6-fachada_1
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_3-Ar_Condicionado_6
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_5-fachada_0
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_9-Ar_Condicionado_6
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_2-fachada_0
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_3-fachada_2
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_10-fachada_5
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_11-fachada_6
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_3-fachada_0
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_9-fachada_3
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_11-cobertura_7
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_6-Ar_Condicionado_6
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_6-fachada_3
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_10-fachada_0
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_8-Ar_Condicionado_6
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_5-Ar_Condicionado_6
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_8-fachada_1
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_7-Ar_Condicionado_6
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_13-fachada_2
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_12-fachada_0
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_7-fachada_3
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_4-fachada_2
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_10-fachada_6
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_7-fachada_1
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_12-fachada_1
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_4-fachada_0
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_12-cobertura_7
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_2-fachada_2
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_11-fachada_5
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    canyonHVAC-Zona_5-fachada_2
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }


    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
